# Data Cleaning and Preparation

## Handling Missing Data

In [41]:
from numpy import nan as NA
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([1,NA,3.5,NA,7])
data.dropna() #Removes NA values

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna() #Removes rows which contain NA values
cleaned

     0    1    2
0  1.0  6.5  3.0

In [6]:
data.dropna(how = "all") #Only drops rows where all values are NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [7]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [9]:
data.dropna(axis = 1, how = "all") #Drops columns where all values are NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.824357       NaN       NaN
1 -0.100219       NaN       NaN
2  0.227134       NaN  0.233702
3  1.722177       NaN -1.403320
4  0.783647 -1.429214  0.640274
5  3.550723  1.040783  0.750350
6 -1.000849  2.273464  1.696879

In [13]:
df.dropna(thresh = 2) #Drop rows wich contain 2 or more NA

          0         1         2
2  0.227134       NaN  0.233702
3  1.722177       NaN -1.403320
4  0.783647 -1.429214  0.640274
5  3.550723  1.040783  0.750350
6 -1.000849  2.273464  1.696879

## Filling in Missing Data

In [14]:
df.fillna(0) #Replaces all NA values with 0

          0         1         2
0  0.824357  0.000000  0.000000
1 -0.100219  0.000000  0.000000
2  0.227134  0.000000  0.233702
3  1.722177  0.000000 -1.403320
4  0.783647 -1.429214  0.640274
5  3.550723  1.040783  0.750350
6 -1.000849  2.273464  1.696879

In [16]:
df.fillna({1:0.5, 2:0}) #Dict represents different fill values for each ith column

          0         1         2
0  0.824357  0.500000  0.000000
1 -0.100219  0.500000  0.000000
2  0.227134  0.500000  0.233702
3  1.722177  0.500000 -1.403320
4  0.783647 -1.429214  0.640274
5  3.550723  1.040783  0.750350
6 -1.000849  2.273464  1.696879

In [17]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.686691 -0.811921 -0.729017
1 -1.187321 -0.237887 -0.453676
2  1.333985       NaN  0.287643
3  0.493183       NaN -0.175387
4 -0.950301       NaN       NaN
5 -0.487321       NaN       NaN

In [19]:
df.fillna(method = "ffill") #Interpolate and fill NA values

          0         1         2
0  0.686691 -0.811921 -0.729017
1 -1.187321 -0.237887 -0.453676
2  1.333985 -0.237887  0.287643
3  0.493183 -0.237887 -0.175387
4 -0.950301 -0.237887 -0.175387
5 -0.487321 -0.237887 -0.175387

In [22]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) #Fill NA values with the mean

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [23]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated() #Returns if each row is a diplicate of a previous

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates() #Removes duplicates from the DataFrame

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
#Filter ONLY by the k1 column (i.e. remove rows with the same data that is is k1 for a previous row)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last') #Remove the duplicate of another which occurs first

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Functions and Mappings

In [35]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [38]:
lowercased = data['food'].str.lower() #Convert to lower case for mapping
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [39]:
#Mapping of each meat to the animal
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [41]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [43]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999.0, np.nan) #Replace -999.0 with nan

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999,-1000], [np.nan, 0]) #Repalace multiple values at once

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999: np.nan, -1000: 0}) #Pass values to replace as a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [9]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

transform = lambda x: x[:4].upper() #Turn indexes uppercase
data.index = data.index.map(transform) #Change the index values in place
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [12]:
data.rename(index = str.title, columns = str.upper) #Modifies without changing the original

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [14]:
data.rename(index = {'OHIO' :'INDIANA'}, columns = {'three':'peekaboo'}) #Replaces each value with specified

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [16]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True) #Modify inplace
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [19]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100] #Bins of 18-25, 26-35, 36-60 and 61-
cats = pd.cut(ages,bins) #DIvide into bins
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [22]:
cats.codes # i th bin which the value at that index belongs in

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [23]:
cats.categories #Distinct categories to split into

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [27]:
pd.value_counts(cats) #Number of items in each category
#Brackets signifies the side is open
#Bracket means it is closed(inclusive)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [29]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names) #Assigns labels to each group

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [31]:
data = np.random.rand(20)
pd.cut(data, 4, precision = 2) #Cuts into 4 equal length bins depending on values generated

[(0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.73, 0.97], ..., (0.26, 0.49], (0.017, 0.26], (0.26, 0.49], (0.73, 0.97], (0.017, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.017, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

AttributeError: module 'pandas' has no attribute 'categories'

In [33]:
data = np.random.randn(1000) #Normally distributed data
cats = pd.qcut(data,4) #Cut into quartiles
cats

[(0.672, 3.805], (-3.354, -0.659], (-0.00746, 0.672], (-3.354, -0.659], (-0.659, -0.00746], ..., (-0.00746, 0.672], (-3.354, -0.659], (-3.354, -0.659], (-0.00746, 0.672], (0.672, 3.805]]
Length: 1000
Categories (4, interval[float64]): [(-3.354, -0.659] < (-0.659, -0.00746] < (-0.00746, 0.672] < (0.672, 3.805]]

In [34]:
cats.categories

IntervalIndex([(-3.354, -0.659], (-0.659, -0.00746], (-0.00746, 0.672], (0.672, 3.805]],
              closed='right',
              dtype='interval[float64]')

In [35]:
pd.value_counts(cats)

(0.672, 3.805]        250
(-0.00746, 0.672]     250
(-0.659, -0.00746]    250
(-3.354, -0.659]      250
dtype: int64

In [36]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]) #Pass in quartiles

[(1.299, 3.805], (-1.254, -0.00746], (-0.00746, 1.299], (-3.354, -1.254], (-1.254, -0.00746], ..., (-0.00746, 1.299], (-1.254, -0.00746], (-1.254, -0.00746], (-0.00746, 1.299], (-0.00746, 1.299]]
Length: 1000
Categories (4, interval[float64]): [(-3.354, -1.254] < (-1.254, -0.00746] < (-0.00746, 1.299] < (1.299, 3.805]]

## Detecting and Filtering Outliers

In [37]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001360    -0.017292     0.015570    -0.030780
std       1.019834     0.988027     0.976213     1.026630
min      -3.943671    -2.853437    -2.723372    -2.905158
25%      -0.666464    -0.692011    -0.614827    -0.734689
50%       0.051962     0.031276     0.007872    -0.019977
75%       0.656661     0.640805     0.672375     0.676800
max       3.322960     3.457978     3.171862     3.577458

In [41]:
col = data[2]
col[np.abs(col) > 3] #Find values in one of the columns exceeding 3 or -3

837    3.171862
Name: 2, dtype: float64

In [43]:
data[(np.abs(data) > 3).any(1)] #Find rows which contain a value exceeding 3 or -3

            0         1         2         3
53  -1.109743  3.039812 -1.130094  1.308423
123 -3.373473 -0.027582  0.750493 -1.623801
318  1.531377  0.896754  0.366834  3.577458
438  3.272425  1.401302 -0.685652  2.223699
447  1.072176  1.947004 -1.143808  3.048139
474  1.789360  3.457978 -0.224829 -1.760552
674 -3.943671  0.030309 -1.096688  1.074912
837  0.872230 -0.538671  3.171862  1.571904
939  3.322960  0.080925 -0.426608  0.141468

In [45]:
data[np.abs(data) > 3] = np.sign(data) * 3 #Cap values greater than 3 and less than -3 to 3 or -3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000638    -0.017790     0.015398    -0.031406
std       1.013591     0.986397     0.975672     1.024615
min      -3.000000    -2.853437    -2.723372    -2.905158
25%      -0.666464    -0.692011    -0.614827    -0.734689
50%       0.051962     0.031276     0.007872    -0.019977
75%       0.656661     0.640805     0.672375     0.676800
max       3.000000     3.000000     3.000000     3.000000

## Permutation and Random Sampling

In [46]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [51]:
sampler = np.random.permutation(5) #Random reordering of the indexes
sampler

array([0, 1, 4, 3, 2])

In [53]:
df.take(sampler) #Reodrder the indexes accoridng to the sampler

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [56]:
df.sample(n=3) #Take a random sample of 3 rows without repetition

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [61]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n= 10, replace= True) #Random sample of 10 values with repetition
draws

3    6
1    7
1    7
0    5
4    4
1    7
3    6
1    7
4    4
2   -1
dtype: int64

## Dummy Values

In [62]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [64]:
pd.get_dummies(df['key']) #Converts categorical data into dummy values

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [66]:
dummies = pd.get_dummies(df['key'], prefix='key') #Get the dummy values and create colmns for each with key_letter
df_with_dummy = df[['data1']].join(dummies) #Add dummies to dataframe
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [71]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep= "::", header= None, names = mnames, engine = "python")
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [74]:
all_genres = []

#Find all the genres 
for x in movies.genres:
    all_genres.extend(x.split('|'))

#Find all the unqiue genres
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [77]:
zero_matrix = np.zeros((len(movies), len(genres))) #Construct zero matrix to hold dummies
dummies = pd.DataFrame(zero_matrix, columns = genres) #Create DataFrame with columns

In [78]:
gen = movies.genres[0]
gen.split('|') #Split the first entry of genres

['Animation', "Children's", 'Comedy']

In [80]:
#Get the index of the location in dummies to add each element of gen to
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [83]:
for i,gen in enumerate(movies.genres):
    indicies = dummies.columns.get_indexer(gen.split('|')) #Get the index to add to
    dummies.iloc[i,indicies] = 1 #Add to the index on the ith row
    
movies_windic = movies.join(dummies.add_prefix("Genre_")) #combine dummies with movies and add prefic 
movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [84]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [85]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

In [4]:
val = "a,b, guido"
val.split(",") #Split by comma

['a', 'b', ' guido']

In [6]:
pieces = [x.strip() for x in val.split(",")]
pieces #Split by comma then remove whitespace

['a', 'b', 'guido']

In [8]:
first, second, third = pieces
first + '::' + second + '::' + third #Conctenate strings

'a::b::guido'

In [10]:
"::".join(pieces) #Join each element of peices with a ::

'a::b::guido'

In [11]:
val.index(",") #Returns index, raises an exception if not found

1

In [13]:
val.find(":") #Returns index, does not raise an error if not found

-1

In [16]:
val.count(',') #Number of occurences of a comma

2

In [18]:
val.replace(",","::") #Replace characters

'a::b:: guido'

In [22]:
val.replace(",",'')

'ab guido'

## Regular Expressions

In [24]:
import re

text = "foo bar\t baz \tqux"

re.split("\s+", text) #Split by regex describing one or more whitespace

['foo', 'bar', 'baz', 'qux']

In [27]:
regex = re.compile('\s+') #Form regex object which can be resused
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [28]:
regex.findall(text)

[' ', '\t ', ' \t']

In [30]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #Regex for detecting email addresses

regex = re.compile(pattern, flags = re.IGNORECASE) #Create regex oject
regex.findall(text) #Find all emails

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [32]:
m = regex.search(text) #Returns object for the first email
text[m.start(): m.end()] #Access email by index

'dave@google.com'

In [33]:
 print(regex.match(text)) #Check if pattern occurs at the start of the string

None

In [35]:
print(regex.sub('REDACTED', text)) #Replace all occurences of the patter with given string

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [36]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' #Adding brackets will split the components
regex = re.compile(pattern, flags=re.IGNORECASE) 
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [37]:
regex.findall(text) #List of tuples where the patterns has occured

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [39]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text)) #Formats with \number

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized string functions

In [42]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [43]:
 data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [44]:
 data.str.contains('gmail') #Checks if the string contains a phrase

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [47]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [49]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [51]:
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [52]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [53]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object